In [1]:
import pandas as pd

In [42]:
df = pd.read_csv("resultat_affare.csv")

In [43]:
df

                             title    price          place     kms
0                         A vendre      NaN   Ariana Ville    2000
1    Peugeot 301 en très bon état    24 000          Radès  144000
2     Renault symbol presque neuf    43 000   Hammam Chott   23000
3                     Peugeot 2008   44 000   Ariana Ville  110000
4          Honda Accord Coupé 2.4l   41 000       Le Bardo  105000
..                             ...      ...            ...     ...
145    Renault talisman grandtour   185 000     El Ouardia   94000
146            Fiat doblo (ndhifa)      NaN        El Ksar     140
147                    Peugeot 407    1 750        Sahloul     545
148        Polo sedan TDI pas taxi   47 000     El Mourouj   70000
149                         Isuzu       NaN  Manouba Ville     NaN

[150 rows x 4 columns]

In [44]:
df.columns

Index(['title', 'price', 'place', 'kms'], dtype='object')

In [45]:
df = df.dropna()

In [46]:
df.loc[df['price'] == max(df['price'])]

              title   price         place    kms
109  Skoda octavia   95 000  Ariana Ville  37000

In [47]:
max(df['price'])

'95 000'

In [30]:
df.groupby('place')['price'].apply(list)

place
Ain Draham                                                           [4500]
Akouda                                                              [22000]
Ariana Ville              [44000, 22500, 22500, 45000, 33000, 95000, 300...
Aïn Zaghouan                                                        [69000]
Ben Arous                                                    [46500, 32000]
Bizerte Nord                                                    [28500, 30]
Bizerte Sud                                                         [34900]
Borj Louzir                                                  [36500, 31000]
Boumhel                                                             [15500]
Carthage                                       [33000, 70000, 79000, 40000]
Dar Châabane El Fehri                                         [1200, 35000]
Djedeida                                                             [9999]
El Mourouj                                     [27500, 62000, 54000, 47000]
El Omrane                                                           [18000]
El Ouardia                                                  [28500, 185000]
Ennasr                                                [40000, 70000, 28500]
Ezzahra                                                 [127000, 26000, 33]
Ghazela                                                             [17000]
Hammam Chott                                                        [43000]
Hammam Lif                                                          [53000]
Hammam Sousse                                                       [33500]
Hammamet                                            [32000, 9999999, 34500]
Jebiniana                                                           [37000]
Jemmal                                                                [600]
Jendouba                                                            [19500]
Jendouba Nord                                                       [25600]
Kairouan Nord                                                       [28000]
Kef Est                                                             [18500]
Korba                                                 [66000, 58000, 92000]
La Marsa                               [31000, 22000, 24500, 120000, 52000]
La Soukra                                      [21800, 49900, 68000, 58000]
Le Bardo                  [41000, 65000, 39800, 160, 72000, 72000, 23000...
Les Berges Du Lac                     [118000, 56000, 130000, 56000, 51000]
Mahdia                                                       [30500, 30500]
Manouba Ville                                         [73000, 23700, 23000]
Medina Jedida                                                       [19000]
Menzah                                                              [55000]
Mnihla                                                              [10500]
Monastir                     [19, 28000, 25500, 37500, 26000, 52000, 15000]
Mégrine                                                      [24900, 42500]
Nabeul                                  [31000, 68000, 25000, 33000, 50000]
Radès                                                               [24000]
Raoued                                                              [11500]
Route Matar                                                        [135000]
Route Menzel Chaker                                                 [32000]
Sahloul                                  [82000, 88000, 63500, 28500, 1750]
Sakiet Eddaïer                                                      [25000]
Sakiet Ezzit                                                 [55000, 55000]
Sayada-Lamta-Bou Hajar                                              [29500]
Sfax Ville                                 [36000, 41, 24000, 60000, 22500]
Sidi Bou Ali                                                        [24500]
Sidi El Béchir                                                      [31500]
Sousse Jawhara                                                         [39]
Zarzouna                                                            [36500]
Name: price, dtype: object

In [63]:
df1 = pd.DataFrame(df['title']+df['price'])

In [64]:
df2 = pd.DataFrame(df['price'])

In [69]:
df1

                                       0
1    Peugeot 301 en très bon état 24 000
2     Renault symbol presque neuf 43 000
3                     Peugeot 200844 000
4          Honda Accord Coupé 2.4l41 000
6           Mini Cooper ou échange65 000
..                                   ...
142             Vente dacia dokker24 500
144                 A vendre MG GS58 000
145   Renault talisman grandtour 185 000
147                     Peugeot 4071 750
148        Polo sedan TDI pas taxi47 000

[122 rows x 1 columns]